---
kind: method
id: M:Autodesk.Revit.DB.TransmissionData.#ctor(Autodesk.Revit.DB.TransmissionData)
source: html/1c43043f-c6bf-1e6f-0947-d3001cfef9bd.htm
---
# Autodesk.Revit.DB.TransmissionData.#ctor Method

Constructs a TransmissionData from another TransmissionData

## Syntax (C#)
```csharp
public TransmissionData(
	TransmissionData other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.TransmissionData`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null